In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
import warnings
warnings.filterwarnings('ignore')

In [3]:
df=pd.read_csv('insurance.csv')

In [4]:
df.head(1)

   age     sex   bmi  children smoker     region    charges
0   19  female  27.9         0    yes  southwest  16884.924

In [5]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [6]:
df1=df.copy()
df2=df.copy()
df3=df.copy()
df4=df.copy()
df5=df.copy()
df6=df.copy()
df7=df.copy()
df8=df.copy()
df9=df.copy()
df10=df.copy()
df11=df.copy()
df12=df.copy()
df13=df.copy()
df14=df.copy()
df15=df.copy()
df16=df.copy()

# Replace Encoding

In [7]:
df1.head(1)

   age     sex   bmi  children smoker     region    charges
0   19  female  27.9         0    yes  southwest  16884.924

In [8]:
df1.sex.unique()

array(['female', 'male'], dtype=object)

In [9]:
df1=df1.replace(['female', 'male'],[1,2])
df1.head(2)

   age  sex    bmi  children smoker     region     charges
0   19    1  27.90         0    yes  southwest  16884.9240
1   18    2  33.77         1     no  southeast   1725.5523

In [10]:
df1.smoker.unique()

array(['yes', 'no'], dtype=object)

In [11]:
df1=df1.replace(['yes', 'no'],[1,2])
df1.head(2)

   age  sex    bmi  children  smoker     region     charges
0   19    1  27.90         0       1  southwest  16884.9240
1   18    2  33.77         1       2  southeast   1725.5523

In [12]:
df1.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [13]:
df1=df1.replace(['southwest', 'southeast', 'northwest', 'northeast'],[1,2,3,4])
df1.tail(3)

      age  sex    bmi  children  smoker  region     charges
1335   18    1  36.85         0       2       2   1629.8335
1336   21    1  25.80         0       2       1   2007.9450
1337   61    1  29.07         0       1       3  29141.3603

# Label Encoder

In [14]:
df2.head(2)

   age     sex    bmi  children smoker     region     charges
0   19  female  27.90         0    yes  southwest  16884.9240
1   18    male  33.77         1     no  southeast   1725.5523

In [15]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [16]:
df2.sex=le.fit_transform(df2.sex)
df2.head(2)

   age  sex    bmi  children smoker     region     charges
0   19    0  27.90         0    yes  southwest  16884.9240
1   18    1  33.77         1     no  southeast   1725.5523

In [17]:
df2.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [18]:
df3.head(1)

   age     sex   bmi  children smoker     region    charges
0   19  female  27.9         0    yes  southwest  16884.924

In [19]:
# for col in df4.columns:
#     if df4[col].dtype==np.number:
#         continue
#     else:
#         df4[col]=LabelEncoder().fit_transform(df4[col])

for col in df3.columns:
    if df3[col].dtype==np.number:
        continue
    else:
        df3[col]=LabelEncoder().fit_transform(df[col])

In [20]:
df3.head(2)

   age  sex    bmi  children  smoker  region     charges
0    1    0  27.90         0       1       3  16884.9240
1    0    1  33.77         1       0       2   1725.5523

# ONE hot encoding

In [21]:
df4.head(1)

   age     sex   bmi  children smoker     region    charges
0   19  female  27.9         0    yes  southwest  16884.924

In [22]:
ohe=pd.get_dummies(df4.sex)
ohe.head(2)

   female  male
0       1     0
1       0     1

In [23]:
target=[['sex','smoker','region']]    

for col in target:
    one=pd.get_dummies(df5[col], drop_first=True,prefix='Remix')
    new_df5=pd.concat([df5,one],axis=1).drop(col, axis=1)

In [24]:
new_df5.head(1)

,age,bmi,children,charges,Remix_male,Remix_yes,Remix_northwest,Remix_southeast,Remix_southwest
0,19,27.9,0,16884.924,0,1,0,0,1

# Ordinal Encoding

In [25]:
df6.head(1)

   age     sex   bmi  children smoker     region    charges
0   19  female  27.9         0    yes  southwest  16884.924

In [26]:
from sklearn.preprocessing import OrdinalEncoder

In [27]:
ev=OrdinalEncoder().fit_transform(df8[['sex','smoker','region']])
ev

array([[0., 1., 3.],
       [1., 0., 2.],
       [1., 0., 2.],
       ...,
       [0., 0., 2.],
       [0., 0., 3.],
       [0., 1., 1.]])

In [30]:
# encoded_values=pd.DataFrame(encoded_values, columns=[['sex_2','smoker_2','region2']])
# encoded_values.head()


ev2=pd.DataFrame(ev,columns=[['sexn','smokern','regionn']])
ev2.head(2)

  sexn smokern regionn
0  0.0     1.0     3.0
1  1.0     0.0     2.0

In [31]:
new_df7=pd.concat([df6,ev2],axis=1)
new_df7.head(2)

,age,sex,bmi,children,smoker,region,charges,"(sexn,)","(smokern,)","(regionn,)"
0,19,female,27.90,0,yes,southwest,16884.9240,0.0,1.0,3.0
1,18,male,33.77,1,no,southeast,1725.5523,1.0,0.0,2.0

In [32]:
new_df7=new_df7.drop('sex',axis=1)
new_df7.head(2)

,age,bmi,children,smoker,region,charges,"(sexn,)","(smokern,)","(regionn,)"
0,19,27.90,0,yes,southwest,16884.9240,0.0,1.0,3.0
1,18,33.77,1,no,southeast,1725.5523,1.0,0.0,2.0

In [33]:
new_df7.head(2)

,age,bmi,children,smoker,region,charges,"(sexn,)","(smokern,)","(regionn,)"
0,19,27.90,0,yes,southwest,16884.9240,0.0,1.0,3.0
1,18,33.77,1,no,southeast,1725.5523,1.0,0.0,2.0

In [34]:
new_df7=new_df7.drop(['smoker','region'],axis=1)
new_df7.head(2)

   age    bmi  children     charges  (sexn,)  (smokern,)  (regionn,)
0   19  27.90         0  16884.9240      0.0         1.0         3.0
1   18  33.77         1   1725.5523      1.0         0.0         2.0

In [35]:
new_df7.head(2)

   age    bmi  children     charges  (sexn,)  (smokern,)  (regionn,)
0   19  27.90         0  16884.9240      0.0         1.0         3.0
1   18  33.77         1   1725.5523      1.0         0.0         2.0